n5/src/InformationRegisters/Gallery/Gallery.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Gallery</name>
  <resources>
    <name>Date</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Description</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Photo</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>User</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </resources>
  <dimensions>
    <name>Reference</name>
    <type>
      <types>CatalogRef.Items</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

n5/src/CommonForms/Pictures/Module.bsl
// *****************************************
// *********** Form events

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	loadPicture ();
	
EndProcedure

&AtServer
Procedure loadPicture ()
	
	HTML = ImagesSrv.Image ( Parameters.ID );
	data = getData ();
	Title = data.Reference + ", " + data.Date + ", " + data.User + ? ( data.Description = "", "", ", " + data.Description );
	
EndProcedure 

&AtServer
Function getData ()
	
	s = "
	|select Gallery.Reference.Description as Reference, Gallery.Date as Date, Gallery.Description as Description,
	|	Gallery.User.Description as User
	|from InformationRegister.Gallery as Gallery
	|where Gallery.ID = &ID
	|";
	q = new Query ( s );
	q.SetParameter ( "ID", Parameters.ID );
	return q.Execute ().Unload () [ 0 ];
	
EndFunction
